In [15]:
import numpy as np
from pandas import Series

s=Series([1,2,3,4,5])
s[(s>3)&(s<5)]

3    4
dtype: int64

In [7]:
print(s)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [22]:
from pandas import DataFrame, read_csv, read_excel
grade_list = [
    {"이름": "철수", "학년": 1, "성별": "남자", "국어": 98, "영어": 77, "수학": 88, "과학": 64},
    {"이름": "영희", "학년": 2, "성별": "여자", "국어": 88, "영어": 90, "수학": 62, "과학": 72},
    {"이름": "민철", "학년": 1, "성별": "남자", "국어": 92, "영어": 70, "수학": 83, "과학": 79},
    {"이름": "수현", "학년": 3, "성별": "여자", "국어": 63, "영어": 60, "수학": 90, "과학": 70},
    {"이름": "호영", "학년": 4, "성별": "남자", "국어": 75, "영어": 50, "수학": 90, "과학": 88}
]

df = DataFrame(grade_list)
df

   이름  학년  성별  국어  영어  수학  과학
0  철수   1  남자  98  77  88  64
1  영희   2  여자  88  90  62  72
2  민철   1  남자  92  70  83  79
3  수현   3  여자  63  60  90  70
4  호영   4  남자  75  50  90  88

In [24]:
df.set_index('이름')
df

   이름  학년  성별  국어  영어  수학  과학
0  철수   1  남자  98  77  88  64
1  영희   2  여자  88  90  62  72
2  민철   1  남자  92  70  83  79
3  수현   3  여자  63  60  90  70
4  호영   4  남자  75  50  90  88